# Примеры карт

int_card = [[0,1,1,0,1,1,0,0,0,0],
						[0,1,0,0,1,0,0,1,0,0],
						[0,1,1,0,1,1,0,1,0,0],
						[0,0,0,0,1,0,0,0,1,0],
						[0,1,0,0,0,0,1,0,0,0]]

# В строковых картах расстановку старта и финиша можно игнорировать но тогда значения
# будут по умолчанию, и старт, и финиш будут в точке (0 0)
# так что поставьте хотя бы финиш.
str_card_1 ='''
. x . x . . . x . . . x x . . . x . x . . . x . . . x x . . . . . . x . . . x x . . .
. x . . x . x . . x . . x . x . x . x . x . . . . . x x . x . . . . x . . . x x . . .
s . x . x . . x . . . x . . . x x . x . . x x . . . x x x . . . . . . . . . . x . x .
. . . . . x . x . x . . . . x . . . x x . x x x x . . . . . . . . . x . . . x . . . .
. x . x . . . x . . . x . . x . x x x . . . x . . . x x . . . . . . . . . . x . x . x
. x . x . . . . . . . x . . . . x . . . . . x . . . x . . x x . . . x . . . x . f . .
. x . x x x x x . . . x . x . . x . x . . . x . . . x x . . . x . . . . . . x x . x x
. x x x . . . x . x . . . x . . x . x . . . . . x . . x x . . x . . x . . . x x . . .
. . . . . x . x . . . x . . x . . . . . . . x . . . x x . x x . . . x . . . . . x . x
. x . x . . . . . . . x . . . . x . x . . . x . . . x . . . . . . . . . . . x . . . x
'''
str_card_2 ='''
. . . . . . . . . . x x x . f
. x . . . . . . . . . . x . .
. x . x x x x x x x x . x . .
. x . . . . . . . . x . x x .
. x x x x x x . . s x . . . .
. x . . . . . . . . x . x . .
. x . x x x x x x x x . x . .
. . . . . . . . . . . . x . .
'''
str_card_3 ='''
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .
. s . . . . . . . . . . f . .
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .
'''